page 50/281
* nutshell

  Page 32 is a summary of basics.

* chapter 1
** journey

   Study regular expression is like studying how to create a car not
   _drive_ a car.

   This is something that also applied to the study of CFD.

** Can you do reg-exp to 24 format time?

   #+BEGIN_SRC sh
     grep "[012][0-9]:[0-5][0-9]" example.org
   #+END_SRC

   #+RESULTS:
   |       10:57 |     |        |
   |       12:30 |     |        |
   |       23:48 |     |        |
   |       00:11 |     |        |
   |       09:59 |     |        |
   | <2019-04-24 | Wed | 09:41> |

   I don't know exactly what the book want me to write? I don't know
   the meaning of this question.

   My regular expression just search the time with a format that is 24
   format. The result shows a positive result.


   #+BEGIN_SRC sh
     perl -w hello.pl 
   #+END_SRC

   #+RESULTS:
   | test. |
   | test. |
   | what? |


   In the if statement, input the regular expression.

   Input: where is the source file that you want to process.

   Output: is the data obtained.

   All you need to do is press: 'C-c C-c' in the following code block:

   #+BEGIN_SRC perl
     open FILE1, "<input.org" or die "Cannot open input.org!";
     open FILE2, ">output.org" or die "Cannot open output.org!";

     my $line;

     while ($line = readline (FILE1)) {

     if ( $line =~ m/12\.([0-9]*)/) {

          print FILE2 "$1 \n";
        }
     }

     close FILE1;
     close FILE2;

   #+END_SRC

   #+RESULTS:
   : 1

   
   ###$price =~ s/(\.\d\d[1-9]+)\d*/$1/;

* chapter 2
** journey
** 
